app/Controllers/Bakul.php

SELECT *
FROM `produk`
WHERE `produk`.`deleted_at` IS NULL
AND `produk`.`id` = '17'
---
    function add() {

        // get id post by name="produk_id" and store in var

        // Undefined method 'getPost'.intelephense(1013)

        // solved undefined method 'getPost' -> https://stackoverflow.com/questions/66152027/codeigniter-undefined-method-getget-intelephense1013

        $produk_id = $this->request->getPost('produk_id');
        $kuantiti = $this->request->getPost('kuantiti');

        //dd($_POST); --> check value array received
        //dd($_POST);
        // die and debug output of data through post method
        // dd( $_POST);

        // find produk id in database by refer to var
        $produk = $this->produk_model->find( $produk_id );

SELECT *
FROM `produk`
WHERE `produk`.`deleted_at` IS NULL
AND `produk`.`id` IN (16,19)
---
        // dd($all_ids);
        // get array value with all id
        // update all item in once only
        $produks = $this->produk_model->find( $all_ids );