app/Controllers/Gambar.php

SELECT *
FROM `gambar`
ORDER BY `id` DESC
 LIMIT 3
SELECT COUNT(*) AS `numrows`
FROM `gambar`
---
    public function index()
    {

        // LOAD MODEL
        $gambar_pelajar = new \App\Models\GambarPelajar();

        // get all data and store into $gambar
        //$gambar = $gambar_pelajar->findAll();

        // pagination data with latest data
        $data = [
            'gambar' => $gambar_pelajar->orderBy('id', 'desc')->paginate(3),
            'pager' => $gambar_pelajar->pager,
        ];