app/Controllers/Gambar.php

        }

        // insert image into database(gambar_pelajar)
        $gambar_pelajar->insert( $data );
---
INSERT INTO `gambar` (`nama`, `kelas`, `tingkatan`, `nama_fail`) VALUES ('AISYA SAFIAH', 'SP', '5', '1659547783_d234feea091ec3ce8899.jpg')