app/Controllers/Produk.php

    function homepage() {

        $data = [
            'produk' => $this->produk_model->orderBy('id', 'desc')->paginate(10),
            'pager' => $this->produk_model->pager,
            'produk_img_lokasi' => $this->produk_img_lokasi
        ];
---
SELECT *
FROM `produk`
WHERE `produk`.`deleted_at` IS NULL
ORDER BY `id` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `produk`
WHERE `produk`.`deleted_at` IS NULL

    public function index()
    {


        // get all data and store into $gambar
        //$gambar = $this->produk_model->findAll();

        // pagination data with latest data
        $data = [
            'produk' => $this->produk_model->orderBy('id', 'desc')->paginate(10),
            'pager' => $this->produk_model->pager,
        ];
---
SELECT *
FROM `produk`
WHERE `produk`.`deleted_at` IS NULL
ORDER BY `id` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `produk`
WHERE `produk`.`deleted_at` IS NULL

    function edit($id)
    {
        // load form   --> this counter error for 'call to undefined function form_open_multiport()
        helper('form');

        // get id from url and store into $gambar
        $produk = $this->produk_model->find( $id );
---
SELECT *
FROM `produk`
WHERE `produk`.`deleted_at` IS NULL
AND `produk`.`id` = '19'

    function slug($slug) {
        $produk = $produk = $this->produk_model->where( 'slug', $slug )->first();
---
SELECT *
FROM `produk`
WHERE `slug` = 'nikecase'
AND `produk`.`deleted_at` IS NULL
 LIMIT 1

        }

        // save image into database(produk_model)
        $this->produk_model->update( $id, $data );
---
UPDATE `produk` SET `nama` = 'Adidas X12002', `harga` = '69009.00', `keterangan` = 'Waterproof and suitable for men style ', `kategori_id` = '4'
WHERE `produk`.`id` IN ('18')