app/Models/KategoriModel.php

    function dropdown() {
        $kategori = $this->findAll();
---
SELECT *
FROM `kategori`